void bubbleSort(int* p, int len);

void bubbleSort(int* p, int len)
{
    for(int i = 0; i < len - 1; ++i) {     // 控制数组的扫描次数
        for (int j = 0; j < len-i-1; ++j)  // 控制元素的比较次数，并进行比较
        if (*(p+j) > *(p+j+1)) {
            *(p+j) = *(p+j) ^ *(p+j+1);
            *(p+j+1) = *(p+j) ^ *(p+j+1);
            *(p+j) = *(p+j+1) ^ *(p+j);
        }
    }
}

/**************************************/
/***********时间复杂度O(n*n)************/
/*********平均时间复杂度O(n*n)**********/
/*********空间复杂度O(1)***************/
/************稳定度：稳定**************/
/************************************/