void selectSort(int* arr, int len)
{
    for (int i = 0; i < len; ++i) {
        int *min = arr+i;  // 假设开始最左边的元素为最小元素，此时记住这个值的地址
        for (int j = i+1; j < len; ++j) {
            if(*min > *(arr+j)) {        // 如果右边的值有比它小，则进行交换
                *min = *min ^ *(p+j);
                *(p+j) = *min ^ *(p+j);
                *min = *min ^ *(p+j);
            }
        }
    }
}


/**************************************/
/***********时间复杂度O(n*n)************/
/*********平均时间复杂度O(n*n)**********/
/*********空间复杂度O(1)***************/
/************稳定度：稳定**************/
/************************************/